# Comics Rx
## [A comic book recommendation system](https://github.com/MangrobanGit/comics_rx)
<img src="https://images.unsplash.com/photo-1514329926535-7f6dbfbfb114?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=2850&q=80" width="400" align='left'>

---

# Libraries

In [1]:
%matplotlib inline
%load_ext autoreload
%autoreload 2  # 1 would be where you need to specify the files
#%aimport data_fcns

In [2]:
import pandas as pd # dataframes

from gspread_pandas import Spread, Client # gsheets interaction
import gspread_pandas

import data_fcns as dfc

# Part 1: Get and Prep Data

## Import Arcane transaction data

### Using **Google Sheets** as a data source

The data is currently stored on Google drive, and is readable as a Google Sheet. I'm going to try to use a Google Sheet API to get into Pandas so I don't have to worry about it traversing across my local machine everytime I need to re-import it.

In [3]:
#gspread_pandas.conf.get_config()

#### Work through `gspread_pandas` Example

In [4]:
file_name = "http://stats.idre.ucla.edu/stat/data/binary.csv"
df = pd.read_csv(file_name)

In [5]:
df.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

In [6]:
spread = Spread('https://docs.google.com/spreadsheets/d/19_AEcTEwHXe7LS-U1scZIHLqP0iF7W4UYMiSlBUE5bs/edit#gid=0')

In [7]:
spread.sheets

In [8]:
spread.url

'https://docs.google.com/spreadsheets/d/19_AEcTEwHXe7LS-U1scZIHLqP0iF7W4UYMiSlBUE5bs'

In [9]:
spread.open_sheet(0)

In [10]:
spread

In [11]:
deef = spread.sheet_to_df(index=None)
deef

  field    nm
0   343   dan
1    44  phil

**Sweet!** That example worked. I was able to download a Google Sheet into this Juypter Notebook as a `pandas dataframe`.  

Let's try to get the dataset!

### Get the transactions dataset

**Instantiate spreadsheet object**

In [12]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1IznAOevvBbV0k3OKPImUMUESSwWXoOaASngPJUepnlU'

trans = Spread(sheet_url)

**Double check details of the spreadsheet  to make sure we are looking at the correct one.**

In [13]:
print(trans.sheets)

print(trans.url)

[<Worksheet 'Copy of Detailed Sales Report.tab' id:1615090597>]
https://docs.google.com/spreadsheets/d/1IznAOevvBbV0k3OKPImUMUESSwWXoOaASngPJUepnlU

**Open the sheet and dump into a Pandas dataframe**

In [14]:
trans.open_sheet(0)

In [15]:
trans_df = trans.sheet_to_df(index=None, start_row=3)
trans_df.head()

,;Department,Category,Item,Description,Qty Sold,Date Sold,Account #
0,Overall,,,,529020,,
1,New Comics,,,,529020,,
2,New Comics,Amaze Ink Slave Labor Graphics,DCD151935,Filler Bunny #2,1,8/14/2011 6:01:03 PM,174
3,New Comics,Amaze Ink Slave Labor Graphics,DCD341726,Gargoyles #6,1,6/22/2012 2:11:37 PM,593
4,New Comics,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,7/21/2010 2:03:07 PM,226

In [16]:
trans_df.tail()

,;Department,Category,Item,Description,Qty Sold,Date Sold,Account #
494700,New Comics,Zenescope Entertainment,DCDL071490,Van Helsing Vs Robyn Hood #2 (,4,1/13/2019 1:05:52 PM,1132
494701,New Comics,Zenescope Entertainment,DCDL062795,Van Helsing Vs the Werewolf #5,4,1/13/2019 1:05:52 PM,1132
494702,New Comics,Zenescope Entertainment,DCDL062795,Van Helsing Vs the Werewolf #5,2,11/7/2018 8:32:23 PM,1132
494703,New Comics,Zenescope Entertainment,DCDL062795,Van Helsing Vs the Werewolf #5,1,2/17/2019 2:01:42 PM,1132
494704,New Comics,Zenescope Entertainment,DCDL109793,Zodiac #1 Cvr E Colapietro,1,4/8/2019 12:30:34 PM,1132

We started at row 3 because I could see that the 'actual' headers didn't start until the third row. We can see the first two rows are likely just summary rows; we can take care of those down below.

Seems good so far. Let's list some tasks we want to accomplish, just from inspecting the rows above:

 - Standardize column headers
 - Make sure date sold is a `date`
 - Change `Account #` to a string?
 - Is `;Department` all the same value? In which case we can probably just drop it.

---

Let's get started. I will save a copy first so I won't have to keep re-importing it from Google Sheets (in case we make a mistake).

In [17]:
trans_df_orig = trans_df.copy()

### Drop rows without account numbers.
This should eliminate the superfluous summary rows.

In [18]:
trans_df = trans_df.loc[trans_df['Account #']!='',:].copy()

Check the values of `;Department`

In [19]:
trans_df[';Department'].unique()

array(['New Comics'], dtype=object)

They're all the same. 

### Drop `;Department` column.

In [20]:
trans_df.drop([';Department'], axis=1, inplace=True)

In [21]:
trans_df.head()

,Category,Item,Description,Qty Sold,Date Sold,Account #
2,Amaze Ink Slave Labor Graphics,DCD151935,Filler Bunny #2,1,8/14/2011 6:01:03 PM,174
3,Amaze Ink Slave Labor Graphics,DCD341726,Gargoyles #6,1,6/22/2012 2:11:37 PM,593
4,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,7/21/2010 2:03:07 PM,226
5,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,7/14/2010 7:49:40 PM,399
6,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,7/19/2010 10:39:04 AM,237

The rest of the columns look useful. Now's a good time to change the column headers to a more standard format.

`Category` looks like Publisher. Let's get the lay of the land.

In [22]:
trans_df['Category'].value_counts()

Marvel Comics                     163423
DC Comics                         121173
Image Comics                       91574
Dark Horse                         26549
Other                              19597
IDW Publishing                     17725
DC Vertigo                         16195
Boom! Studios                      12164
Oni Press                           8022
D.E.                                6220
Avatar Press                        5386
Archie Comics                       1952
Zenescope Entertainment             1176
Image Topcow                        1007
Bongo Comics                         721
DC Wildstorm                         538
Red 5 Comics                         472
Fantagraphics                        332
Aspen MLT                            299
Radical Publishing                   112
Drawn & Quarterly                     44
Amaze Ink Slave Labor Graphics        11
D.D.P.                                10
Top Shelf Productions                  1
Name: Category, dtype: int64

It looks like it's basically the publisher fo the comic. This is likely the context of Category relative to 
`;Department` of `New Comics` that we dropped earlier.

Let's look at those headers again.

In [23]:
trans_df.head(1)

,Category,Item,Description,Qty Sold,Date Sold,Account #
2,Amaze Ink Slave Labor Graphics,DCD151935,Filler Bunny #2,1,8/14/2011 6:01:03 PM,174

### Assign new column names.

In [24]:
# Create list of new column names
col_names = ['publisher', 'item_id', 'title_and_num', 'qty_sold', 'date_sold', 'account_num']

In [25]:
trans_df.columns = col_names

In [26]:
trans_df.head(1)

,publisher,item_id,title_and_num,qty_sold,date_sold,account_num
2,Amaze Ink Slave Labor Graphics,DCD151935,Filler Bunny #2,1,8/14/2011 6:01:03 PM,174

### Convert Account Number to string with leading zeroes

Let's look at those account numbers.

In [27]:
trans_df['account_num'].value_counts()

1132    8944
191     6960
134     6231
108     5211
906     5136
267     4939
961     4208
566     4152
174     4038
224     3994
163     3727
275     3716
84      3568
149     3552
210     3336
75      3260
1213    3233
1047    3224
1275    3220
79      3148
237     3044
99      2999
578     2800
821     2696
37      2600
226     2506
1858    2494
1270    2402
143     2391
186     2384
        ...
3008       1
2684       1
1131       1
885        1
493        1
2545       1
1347       1
2594       1
3025       1
891        1
2968       1
2952       1
2864       1
1835       1
887        1
2403       1
2593       1
1002       1
1675       1
1428       1
931        1
813        1
1105       1
1709       1
1312       1
2855       1
2478       1
2712       1
1564       1
414        1
Name: account_num, Length: 1717, dtype: int64

In [28]:
trans_df['account_num'].max()

'998'

That's not what I expected for max. Probably a string.

In [29]:
trans_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 494703 entries, 2 to 494704
Data columns (total 6 columns):
publisher        494703 non-null object
item_id          494703 non-null object
title_and_num    494703 non-null object
qty_sold         494703 non-null object
date_sold        494703 non-null object
account_num      494703 non-null object
dtypes: object(6)
memory usage: 26.4+ MB

Yes, that is the case.

In [30]:
trans_df['account_num'].astype(int).max()

3123

Ok that seems more realistic. Let's add some leading zeros. 

Since there are about 3K accounts, let's just settle on 5 characters.

In [31]:
trans_df['account_num'] = trans_df['account_num'].str.zfill(5)

trans_df['account_num'].head()

2    00174
3    00593
4    00226
5    00399
6    00237
Name: account_num, dtype: object

In [32]:
trans_df.head()

,publisher,item_id,title_and_num,qty_sold,date_sold,account_num
2,Amaze Ink Slave Labor Graphics,DCD151935,Filler Bunny #2,1,8/14/2011 6:01:03 PM,00174
3,Amaze Ink Slave Labor Graphics,DCD341726,Gargoyles #6,1,6/22/2012 2:11:37 PM,00593
4,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,7/21/2010 2:03:07 PM,00226
5,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,7/14/2010 7:49:40 PM,00399
6,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,7/19/2010 10:39:04 AM,00237

### Convert dates

Found a relatively quick date converter on StackOverflow:  
https://stackoverflow.com/questions/29882573/pandas-slow-date-conversion

Saved a copy in custom libary, `data_fcns`

In [33]:
trans_df['date_sold'] = dfc.date_converter(trans_df['date_sold'])

In [34]:
trans_df.head()

,publisher,item_id,title_and_num,qty_sold,date_sold,account_num
2,Amaze Ink Slave Labor Graphics,DCD151935,Filler Bunny #2,1,2011-08-14 18:01:03,00174
3,Amaze Ink Slave Labor Graphics,DCD341726,Gargoyles #6,1,2012-06-22 14:11:37,00593
4,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,2010-07-21 14:03:07,00226
5,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,2010-07-14 19:49:40,00399
6,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,2010-07-19 10:39:04,00237

In [35]:
trans_df.tail()

,publisher,item_id,title_and_num,qty_sold,date_sold,account_num
494700,Zenescope Entertainment,DCDL071490,Van Helsing Vs Robyn Hood #2 (,4,2019-01-13 13:05:52,01132
494701,Zenescope Entertainment,DCDL062795,Van Helsing Vs the Werewolf #5,4,2019-01-13 13:05:52,01132
494702,Zenescope Entertainment,DCDL062795,Van Helsing Vs the Werewolf #5,2,2018-11-07 20:32:23,01132
494703,Zenescope Entertainment,DCDL062795,Van Helsing Vs the Werewolf #5,1,2019-02-17 14:01:42,01132
494704,Zenescope Entertainment,DCDL109793,Zodiac #1 Cvr E Colapietro,1,2019-04-08 12:30:34,01132

Seems ok!

### Create `comic_title` column

Individual issues are not going to work for recommendations. We'll need to roll it up to title/volume is possible. For example: *Spider-Man* is useful; *Spider-Man #23* is not.

Based on what data we have available at this time, for the time being I think the following will have to suffice to proxy `comic_title`:

- Cut off the issue number off of `title_and_num`
- Concatenate `publisher` on the back end to prevent any potential duplicate titles across publishers.

We created function to strip off everything to the right of the pound sign (#) on a string, named `cut_issue_num`. Refer to the library `data_fcns`.

In [36]:
trans_df['comic_title'] = ( trans_df['title_and_num'].apply(dfc.cut_issue_num) + 
                        ' (' + trans_df['publisher'] + ')' )

In [37]:
trans_df.head()

,publisher,item_id,title_and_num,qty_sold,date_sold,account_num,comic_title
2,Amaze Ink Slave Labor Graphics,DCD151935,Filler Bunny #2,1,2011-08-14 18:01:03,00174,Filler Bunny (Amaze Ink Slave Labor Graphics)
3,Amaze Ink Slave Labor Graphics,DCD341726,Gargoyles #6,1,2012-06-22 14:11:37,00593,Gargoyles (Amaze Ink Slave Labor Graphics)
4,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,2010-07-21 14:03:07,00226,Royal Historian of Oz (Amaze Ink Slave Labor G...
5,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,2010-07-14 19:49:40,00399,Royal Historian of Oz (Amaze Ink Slave Labor G...
6,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,2010-07-19 10:39:04,00237,Royal Historian of Oz (Amaze Ink Slave Labor G...

The publisher names can be unwieldly long. I will create a dictionary to shorten so easier to digest the title names once the the publisher is concatentated. 

Refer to `code_archive.py` and `data_fcns.py` for development and final output.

In [42]:
dfc.pub_dict

{'Amaze Ink Slave Labor Graphics': 'SLG',
 'Archie Comics': 'Archie',
 'Aspen MLT': 'Aspen',
 'Avatar Press': 'Avatar',
 'Bongo Comics': 'Bongo',
 'Boom! Studios': 'Boom',
 'D.D.P.': 'DDP',
 'D.E.': 'DE',
 'Dark Horse': 'Dark Horse',
 'DC Comics': 'DC',
 'DC Vertigo': 'Vertigo',
 'DC Wildstorm': 'Wildstorm',
 'Drawn & Quarterly': 'D&Q',
 'Fantagraphics': 'Fantagraphics',
 'IDW Publishing': 'IDW',
 'Image Comics': 'Image',
 'Image Topcow': 'Topcow',
 'Marvel Comics': 'Marvel',
 'Oni Press': 'Oni',
 'Other': 'Other',
 'Radical Publishing': 'Radical',
 'Red 5 Comics': 'Red 5',
 'Top Shelf Productions': 'Top Shelf',
 'Zenescope Entertainment': 'Zenescope'}

Ok, let's go ahead and redo the `comic_title` with the shorter publisher names.

In [39]:
trans_df['comic_title'] = ( trans_df['title_and_num'].apply(dfc.cut_issue_num) + 
                        ' (' + trans_df['publisher'].map(dfc.pub_dict) + ')' )

In [40]:
trans_df.head()

,publisher,item_id,title_and_num,qty_sold,date_sold,account_num,comic_title
2,Amaze Ink Slave Labor Graphics,DCD151935,Filler Bunny #2,1,2011-08-14 18:01:03,00174,Filler Bunny (SLG)
3,Amaze Ink Slave Labor Graphics,DCD341726,Gargoyles #6,1,2012-06-22 14:11:37,00593,Gargoyles (SLG)
4,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,2010-07-21 14:03:07,00226,Royal Historian of Oz (SLG)
5,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,2010-07-14 19:49:40,00399,Royal Historian of Oz (SLG)
6,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,2010-07-19 10:39:04,00237,Royal Historian of Oz (SLG)

In [41]:
trans_df.tail()

,publisher,item_id,title_and_num,qty_sold,date_sold,account_num,comic_title
494700,Zenescope Entertainment,DCDL071490,Van Helsing Vs Robyn Hood #2 (,4,2019-01-13 13:05:52,01132,Van Helsing Vs Robyn Hood (Zenescope)
494701,Zenescope Entertainment,DCDL062795,Van Helsing Vs the Werewolf #5,4,2019-01-13 13:05:52,01132,Van Helsing Vs the Werewolf (Zenescope)
494702,Zenescope Entertainment,DCDL062795,Van Helsing Vs the Werewolf #5,2,2018-11-07 20:32:23,01132,Van Helsing Vs the Werewolf (Zenescope)
494703,Zenescope Entertainment,DCDL062795,Van Helsing Vs the Werewolf #5,1,2019-02-17 14:01:42,01132,Van Helsing Vs the Werewolf (Zenescope)
494704,Zenescope Entertainment,DCDL109793,Zodiac #1 Cvr E Colapietro,1,2019-04-08 12:30:34,01132,Zodiac (Zenescope)

YES.

Okay, I think the last think is to convert the `qty_sold` column to an integer.

### Convert `qty_sold` to integer

In [43]:
trans_df['qty_sold'] = trans_df['qty_sold'].astype(int)

In [44]:
trans_df.head()

,publisher,item_id,title_and_num,qty_sold,date_sold,account_num,comic_title
2,Amaze Ink Slave Labor Graphics,DCD151935,Filler Bunny #2,1,2011-08-14 18:01:03,00174,Filler Bunny (SLG)
3,Amaze Ink Slave Labor Graphics,DCD341726,Gargoyles #6,1,2012-06-22 14:11:37,00593,Gargoyles (SLG)
4,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,2010-07-21 14:03:07,00226,Royal Historian of Oz (SLG)
5,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,2010-07-14 19:49:40,00399,Royal Historian of Oz (SLG)
6,Amaze Ink Slave Labor Graphics,DCD416182,Royal Historian of Oz #1,1,2010-07-19 10:39:04,00237,Royal Historian of Oz (SLG)

In [46]:
trans_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 494703 entries, 2 to 494704
Data columns (total 7 columns):
publisher        494703 non-null object
item_id          494703 non-null object
title_and_num    494703 non-null object
qty_sold         494703 non-null int64
date_sold        494703 non-null datetime64[ns]
account_num      494703 non-null object
comic_title      494703 non-null object
dtypes: datetime64[ns](1), int64(1), object(5)
memory usage: 30.2+ MB

OK! I think this is all we can do for now. Let's save this to a DB.

# Part 2: Save to AWS DB

In [58]:
import os

#Data storage
from sqlalchemy import create_engine # SQL helper
import psycopg2 as psql #PostgreSQL DBs

import keys  # Custom keys lib

### Set up AWS connection to PostgreSQL DB

In [56]:
# Define path to secret
secret_path_aws = os.path.join(os.environ['HOME'], '.secret', 
                           'aws_ps_flatiron.json')
secret_path_aws

'/Users/werlindo/.secret/aws_ps_flatiron.json'

In [57]:
aws_keys = keys.get_keys(secret_path_aws)
user = aws_keys['user']
ps = aws_keys['password']
host = aws_keys['host']
db = aws_keys['db_name']

aws_ps_engine = ('postgresql://' + user + ':' + ps + '@' + host + '/' + db)

# Setup PSQL connection
conn = psql.connect(
    database=db,
    user=user,
    password=ps,
    host=host,
    port='5432'
)

### Write dataframe to DB

Use SQLAlchemy to create PSQL engine

In [60]:
# dialect+driver://username:password@host:port/database
sql_alch_engine = create_engine(aws_ps_engine)

In [ ]:
# Use built-in pandas functionality to write to AWS
trans_tbl_nm = 'comic_trans'
trans_df.to_sql(trans_tbl_nm, con=sql_alch_engine, if_exists='append')